app/views/api/tags/index.json.jbuilder

  json.label = tag.label
  json.count = tag.taggings.length
---
SELECT "taggings".* FROM "taggings" WHERE "taggings"."tag_id" = $1  [["tag_id", 1]]
SELECT "tags".* FROM "tags"