app/controllers/api/annotations_controller.rb

INSERT INTO "annotations" ("recipe_id", "start_idx", "end_idx", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @annotation = current_user.annotations.new(annotation_params)
    if @annotation.save

SELECT  "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @annotation = Annotation.find(params[:id])