app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("commentable_id", "commentable_type", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @comment = current_user.comments.new(comment_params)
    if @comment.save