app/controllers/api/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    if params[:query] || params["query"]
      @recipes = Recipe.
                   includes(:author, :tags).
                   where("recipes.title LIKE '%#{params[:query]}%'")
    else
      @recipes = Recipe.includes(:author, :image).all

INSERT INTO "tags" ("label", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["label", "tag2"], ["created_at", "2015-08-13 22:24:45.528503"], ["updated_at", "2015-08-13 22:24:45.528503"]]
INSERT INTO "recipes" ("title", "body", "image_url", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["body", "aaaaaa"], ["image_url", ""], ["author_id", 1], ["created_at", "2015-08-11 18:52:43.147567"], ["updated_at", "2015-08-11 18:52:43.147567"]]
---
  def create
    tag_ids = []
    params[:tags].each do |tag|
      id = Tag.findOrCreate(tag).id
      tag_ids << id if id
    end
    @recipe = current_user.recipes.new(recipe_params.
      merge(tag_ids: tag_ids).
      merge(image: Image.find(params[:image_id]))
    )
    if @recipe.save